Управление_по_целям_и_KPI/src/Catalogs/KPI_ЦелевыеПоказатели/KPI_ЦелевыеПоказатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>KPI_ЦелевыеПоказатели</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СмартЗадача</name>
      <description>Смарт-задача</description>
    </items>
    <items>
      <name>Стандарт</name>
      <description>Стандарт</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.KPI_ТипыПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасчетаЗначенияФакта</name>
    <type>
      <types>EnumRef.KPI_ТипыРасчетаФакта</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.KPI_ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасчетаЗначенияПлана</name>
    <type>
      <types>EnumRef.KPI_ТипыРасчетаПлана</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегированиеПлана</name>
    <type>
      <types>EnumRef.KPI_Агрегирование</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегированиеФакта</name>
    <type>
      <types>EnumRef.KPI_Агрегирование</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетРезультативности</name>
    <type>
      <types>EnumRef.KPI_ВидыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Шкала</name>
    <type>
      <types>CatalogRef.KPI_Шкалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НижняяГраница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерхняяГраница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеВерхняяГраница</name>
    <type>
      <types>EnumRef.KPI_ГраницыСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНижняяГраница</name>
    <type>
      <types>EnumRef.KPI_ГраницыСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеАналитики1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеАналитики2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеАналитики3</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеАналитики4</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеАналитики5</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАналитики1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАналитики2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАналитики3</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАналитики4</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАналитики5</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСвязиФакта</name>
    <type>
      <types>EnumRef.KPI_ВидыСвязиФормулы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСвязиПлана</name>
    <type>
      <types>EnumRef.KPI_ВидыСвязиФормулы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаСписокФакт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаСписокПлан</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.KPI_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИнвертированный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементыСвязейФакт</name>
    <comment>Массив элементов структуры компании факт</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементыСвязейПлан</name>
    <comment>Массив элементов структуры компании план</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Инвертирование</name>
    <comment>Зеленый-ложь, красный-истина</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАналитики1Представление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАналитики2Представление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАналитики3Представление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАналитики4Представление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАналитики5Представление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КолВоПериодовНазад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ФормулаФакта</name>
    <attributes>
      <name>ЦелевойПоказатель</name>
      <type>
        <types>CatalogRef.KPI_ЦелевыеПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеФильтраАналитик</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючАналитики</name>
      <type>
        <types>CatalogRef.KPI_КлючиАналитики</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормулаПлана</name>
    <attributes>
      <name>ЦелевойПоказатель</name>
      <type>
        <types>CatalogRef.KPI_ЦелевыеПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеФильтраАналитик</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючАналитики</name>
      <type>
        <types>CatalogRef.KPI_КлючиАналитики</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_по_целям_и_KPI/src/Catalogs/KPI_ЦелевыеПоказатели/ManagerModule.bsl
Функция РассчитатьЗначениеЦелевогоПоказателя(СтрокаЦелевойПоказатель, Сотрудник, ПланыФакты, АдресПланФакты) Экспорт
	
	ЗначениеПоказателя = 0;
	ЦелевойПоказатель = СтрокаЦелевойПоказатель.ЦелевойПоказатель;
	
	КритерийПоискаСотрудник = Новый Структура;
	КритерийПоискаСотрудник.Вставить("СтруктураКомпании", Сотрудник.СтруктураКомпании);
	КритерийПоискаСотрудник.Вставить("ЦелевойПоказатель", ЦелевойПоказатель);
	
	НайденныеСтроки = ПланыФакты.НайтиСтроки(КритерийПоискаСотрудник);
	
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		#ЕСЛИ Сервер Тогда
			СтрокаПланФакт       = НайденныеСтроки[0];
			
			ПредставлениеРесурса = KPI_ИнтерфейсСерверПовтИсп.ПредставленияРесурсаЦелевогоПоказателя(СтрокаЦелевойПоказатель.Ресурс);
			Ресурс               = СтрокаПланФакт[ПредставлениеРесурса];
			
			Если ЗначениеЗаполнено(СтрокаЦелевойПоказатель.МатрицаРаспределения) Тогда
				
				МатрицаРаспределения = СтрокаЦелевойПоказатель.МатрицаРаспределения;
				
				Аналитики = Новый Структура("ЦелевойПоказатель");
				ЗаполнитьЗначенияСвойств(Аналитики, СтрокаПланФакт);
				Если ЗначениеЗаполнено(СтрокаЦелевойПоказатель.КлючАналитики) Тогда
					Аналитики.Вставить("КлючАналитики", СтрокаЦелевойПоказатель.КлючАналитики);
				КонецЕсли;				
				
				ЗначениеПоказателя	 = KPI_ИнтерфейсСерверПовтИсп.ЗначениеРесурсаМатрицыРаспределения(
					АдресПланФакты, МатрицаРаспределения, Аналитики, ПредставлениеРесурса, СтрокаЦелевойПоказатель.Шкала);
				
			Иначе
					
				Попытка
					ЗначениеПоказателя	 = Справочники.KPI_Шкалы.ЗначениеРесурсаЦелевогоПоказателяПоШкале(СтрокаЦелевойПоказатель.Шкала, Ресурс);
				Исключение
					KPI_ИнтерфейсКлиентСервер.СообщитьОбОшибке("Ошибка! не удалось рассчитать показатель """ + ЦелевойПоказатель +""" по сотруднику " + Сотрудник + "." );
					ЗначениеПоказателя = 0;	
				КонецПопытки;
								
			КонецЕсли;
		#КонецЕсли
	КонецЕсли;

	Возврат ЗначениеПоказателя;
КонецФункции
